[Killed] BlockStatement
src/infra/ArrayStack.ts:6:23
 export class ArrayStack<T> implements IStack<T> {
   private items: T[] = [];
 
-  push(item: T): void { this.items.push(item); }
+  push(item: T): void {}
   pop(): T | undefined { return this.items.pop(); }
   peek(): T | undefined { return this.items[this.items.length - 1]; }
killedBy: TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected # found </B>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] ArithmeticOperator
src/infra/ArrayStack.ts:8:45
 
   push(item: T): void { this.items.push(item); }
   pop(): T | undefined { return this.items.pop(); }
-  peek(): T | undefined { return this.items[this.items.length - 1]; }
+  peek(): T | undefined { return this.items[this.items.length + 1]; }
   isEmpty(): boolean { return this.items.length === 0; }
   clear(): void { this.items = []; }
killedBy: TagChecker missing closing tag at paragraph end; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Expected </undefined> found #' to be 'Expected </B> found #' // Object.is equality

[Killed] ConditionalExpression
src/infra/ArrayStack.ts:9:31
   push(item: T): void { this.items.push(item); }
   pop(): T | undefined { return this.items.pop(); }
   peek(): T | undefined { return this.items[this.items.length - 1]; }
-  isEmpty(): boolean { return this.items.length === 0; }
+  isEmpty(): boolean { return false; }
   clear(): void { this.items = []; }
 }
killedBy: TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </undefined> found #' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] ConditionalExpression
src/infra/ArrayStack.ts:9:31
   push(item: T): void { this.items.push(item); }
   pop(): T | undefined { return this.items.pop(); }
   peek(): T | undefined { return this.items[this.items.length - 1]; }
-  isEmpty(): boolean { return this.items.length === 0; }
+  isEmpty(): boolean { return true; }
   clear(): void { this.items = []; }
 }
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality
