[Killed] EqualityOperator
src/infra/SimpleTagScanner.ts:6:21
 
 export class SimpleTagScanner implements ITagScanner {
   *scan(paragraph: string): Iterable<TagToken> {
-    for (let i = 0; i < paragraph.length; i++) {
+    for (let i = 0; i >= paragraph.length; i++) {
       if (paragraph[i] !== "<") continue;
 
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Survived] EqualityOperator
src/infra/SimpleTagScanner.ts:6:21
 
 export class SimpleTagScanner implements ITagScanner {
   *scan(paragraph: string): Iterable<TagToken> {
-    for (let i = 0; i < paragraph.length; i++) {
+    for (let i = 0; i <= paragraph.length; i++) {
       if (paragraph[i] !== "<") continue;
 

[Killed] ConditionalExpression
src/infra/SimpleTagScanner.ts:7:11
 export class SimpleTagScanner implements ITagScanner {
   *scan(paragraph: string): Iterable<TagToken> {
     for (let i = 0; i < paragraph.length; i++) {
-      if (paragraph[i] !== "<") continue;
+      if (false) continue;
 
       const j = paragraph.indexOf(">", i + 1);
killedBy: SimpleTagScanner + TagChecker edge-cases valid tags among noise remain valid; TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </A> found #' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] EqualityOperator
src/infra/SimpleTagScanner.ts:7:11
 export class SimpleTagScanner implements ITagScanner {
   *scan(paragraph: string): Iterable<TagToken> {
     for (let i = 0; i < paragraph.length; i++) {
-      if (paragraph[i] !== "<") continue;
+      if (paragraph[i] === "<") continue;
 
       const j = paragraph.indexOf(">", i + 1);
killedBy: SimpleTagScanner tokenization yields only exact <X> and </X> tokens
statusReason: expected [ { kind: 'open', tag: 'B' }, …(1) ] to deeply equal [ { kind: 'open', tag: 'A' }, …(1) ]

[Timeout] ArithmeticOperator
src/infra/SimpleTagScanner.ts:9:40
     for (let i = 0; i < paragraph.length; i++) {
       if (paragraph[i] !== "<") continue;
 
-      const j = paragraph.indexOf(">", i + 1);
+      const j = paragraph.indexOf(">", i - 1);
       if (j === -1) break; // no closing bracket â†’ stop scanning
 

[Killed] EqualityOperator
src/infra/SimpleTagScanner.ts:10:11
       if (paragraph[i] !== "<") continue;
 
       const j = paragraph.indexOf(">", i + 1);
-      if (j === -1) break; // no closing bracket â†’ stop scanning
+      if (j !== -1) break; // no closing bracket â†’ stop scanning
 
       const inside = paragraph.slice(i + 1, j);
killedBy: TagChecker wrongly nested tags; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </C> found </B>' // Object.is equality

[Timeout] UnaryOperator
src/infra/SimpleTagScanner.ts:10:17
       if (paragraph[i] !== "<") continue;
 
       const j = paragraph.indexOf(">", i + 1);
-      if (j === -1) break; // no closing bracket â†’ stop scanning
+      if (j === +1) break; // no closing bracket â†’ stop scanning
 
       const inside = paragraph.slice(i + 1, j);

[Killed] ArithmeticOperator
src/infra/SimpleTagScanner.ts:12:38
       const j = paragraph.indexOf(">", i + 1);
       if (j === -1) break; // no closing bracket â†’ stop scanning
 
-      const inside = paragraph.slice(i + 1, j);
+      const inside = paragraph.slice(i - 1, j);
 
       // guard 1: skip empty tags like <>    
killedBy: TagChecker wrongly nested tags; SimpleTagScanner tokenization yields only exact <X> and </X> tokens; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </C> found </B>' // Object.is equality

[Killed] MethodExpression
src/infra/SimpleTagScanner.ts:12:22
       const j = paragraph.indexOf(">", i + 1);
       if (j === -1) break; // no closing bracket â†’ stop scanning
 
-      const inside = paragraph.slice(i + 1, j);
+      const inside = paragraph;
 
       // guard 1: skip empty tags like <>    
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer; SimpleTagScanner tokenization yields only exact <X> and </X> tokens; TagChecker wrongly nested tags
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Survived] ConditionalExpression
src/infra/SimpleTagScanner.ts:15:11
       const inside = paragraph.slice(i + 1, j);
 
       // guard 1: skip empty tags like <>    
-      if (inside.length === 0) { i = j; continue; }
+      if (false) { i = j; continue; }
 
       // guard 2: only accept <X> or </X> where X is Aâ€“Z

[Survived] BlockStatement
src/infra/SimpleTagScanner.ts:15:32
       const inside = paragraph.slice(i + 1, j);
 
       // guard 1: skip empty tags like <>    
-      if (inside.length === 0) { i = j; continue; }
+      if (inside.length === 0) {}
 
       // guard 2: only accept <X> or </X> where X is Aâ€“Z

[Killed] Regex
src/infra/SimpleTagScanner.ts:18:22
       if (inside.length === 0) { i = j; continue; }
 
       // guard 2: only accept <X> or </X> where X is Aâ€“Z
-      const isOpen = /^[A-Z]$/.test(inside);
+      const isOpen = /[A-Z]$/.test(inside);
       const isClose = /^\/[A-Z]$/.test(inside);
       if (!isOpen && !isClose) { i = j; continue; }
killedBy: SimpleTagScanner + TagChecker edge-cases multi-letter opener '<AB>' is NOT a valid tag; SimpleTagScanner tokenization yields only exact <X> and </X> tokens; TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected <//AB> found #' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] Regex
src/infra/SimpleTagScanner.ts:18:22
       if (inside.length === 0) { i = j; continue; }
 
       // guard 2: only accept <X> or </X> where X is Aâ€“Z
-      const isOpen = /^[A-Z]$/.test(inside);
+      const isOpen = /^[^A-Z]$/.test(inside);
       const isClose = /^\/[A-Z]$/.test(inside);
       if (!isOpen && !isClose) { i = j; continue; }
killedBy: TagChecker correctly tagged simple paragraph; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Expected # found </B>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] BooleanLiteral
src/infra/SimpleTagScanner.ts:20:11
       // guard 2: only accept <X> or </X> where X is Aâ€“Z
       const isOpen = /^[A-Z]$/.test(inside);
       const isClose = /^\/[A-Z]$/.test(inside);
-      if (!isOpen && !isClose) { i = j; continue; }
+      if (isOpen && !isClose) { i = j; continue; }
 
       if (isOpen) {
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Killed] LogicalOperator
src/infra/SimpleTagScanner.ts:20:11
       // guard 2: only accept <X> or </X> where X is Aâ€“Z
       const isOpen = /^[A-Z]$/.test(inside);
       const isClose = /^\/[A-Z]$/.test(inside);
-      if (!isOpen && !isClose) { i = j; continue; }
+      if (!isOpen || !isClose) { i = j; continue; }
 
       if (isOpen) {
killedBy: TagChecker wrongly nested tags
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </C> found </B>' // Object.is equality

[Killed] BlockStatement
src/infra/SimpleTagScanner.ts:22:19
       const isClose = /^\/[A-Z]$/.test(inside);
       if (!isOpen && !isClose) { i = j; continue; }
 
-      if (isOpen) {
-        yield { kind: "open", tag: inside };
-      } else {
+      if (isOpen) {} else {
         const tag = inside[1];
         if (!tag) { i = j; continue; } // extra safety
killedBy: SimpleTagScanner tokenization yields only exact <X> and </X> tokens; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer; TagChecker correctly tagged simple paragraph
statusReason: expected [ { kind: 'close', tag: 'A' } ] to deeply equal [ { kind: 'open', tag: 'A' }, …(1) ]

[Killed] ConditionalExpression
src/infra/SimpleTagScanner.ts:22:11
       const isClose = /^\/[A-Z]$/.test(inside);
       if (!isOpen && !isClose) { i = j; continue; }
 
-      if (isOpen) {
+      if (false) {
         yield { kind: "open", tag: inside };
       } else {
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer; SimpleTagScanner tokenization yields only exact <X> and </X> tokens; TagChecker correctly tagged simple paragraph
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Killed] BlockStatement
src/infra/SimpleTagScanner.ts:24:14
 
       if (isOpen) {
         yield { kind: "open", tag: inside };
-      } else {
-        const tag = inside[1];
-        if (!tag) { i = j; continue; } // extra safety
-        yield { kind: "close", tag };
-      }
+      } else {}
 
       i = j; // advance past '>'
killedBy: SimpleTagScanner tokenization yields only exact <X> and </X> tokens; SimpleTagScanner + TagChecker edge-cases '<AB></B>' should *not* treat '<AB>' as <A>
statusReason: expected [ { kind: 'open', tag: 'A' } ] to deeply equal [ { kind: 'open', tag: 'A' }, …(1) ]
