[Killed] BlockStatement
src/app/TagChecker.ts:14:55
   checkParagraph(paragraph: string): string {
     this.stack.clear();
 
-    for (const token of this.scanner.scan(paragraph)) {
-      if (token.kind === "open") {
-        this.stack.push(token.tag);
-        continue;
-      }
-
-      const top = this.stack.pop();
-      if (!top) return `Expected # found </${token.tag}>`;
-      if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
-    }
+    for (const token of this.scanner.scan(paragraph)) {}
 
     if (!this.stack.isEmpty()) {
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer; TagChecker wrongly nested tags
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Killed] ConditionalExpression
src/app/TagChecker.ts:15:11
     this.stack.clear();
 
     for (const token of this.scanner.scan(paragraph)) {
-      if (token.kind === "open") {
+      if (false) {
         this.stack.push(token.tag);
         continue;
killedBy: TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected # found </C>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] BlockStatement
src/app/TagChecker.ts:15:34
     this.stack.clear();
 
     for (const token of this.scanner.scan(paragraph)) {
-      if (token.kind === "open") {
-        this.stack.push(token.tag);
-        continue;
-      }
+      if (token.kind === "open") {}
 
       const top = this.stack.pop();
killedBy: TagChecker correctly tagged simple paragraph; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected 'Expected # found </C>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] BooleanLiteral
src/app/TagChecker.ts:21:11
       }
 
       const top = this.stack.pop();
-      if (!top) return `Expected # found </${token.tag}>`;
+      if (top) return `Expected # found </${token.tag}>`;
       if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
     }
killedBy: SimpleTagScanner + TagChecker edge-cases '<AB></B>' should *not* treat '<AB>' as <A>; TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </undefined> found </B>' to be 'Expected # found </B>' // Object.is equality

[Killed] ConditionalExpression
src/app/TagChecker.ts:21:11
       }
 
       const top = this.stack.pop();
-      if (!top) return `Expected # found </${token.tag}>`;
+      if (false) return `Expected # found </${token.tag}>`;
       if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
     }
killedBy: SimpleTagScanner + TagChecker edge-cases '<AB></B>' should *not* treat '<AB>' as <A>; TagChecker extra closing tag
statusReason: expected 'Expected </undefined> found </B>' to be 'Expected # found </B>' // Object.is equality

[Killed] EqualityOperator
src/app/TagChecker.ts:22:11
 
       const top = this.stack.pop();
       if (!top) return `Expected # found </${token.tag}>`;
-      if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
+      if (top === token.tag) return `Expected </${top}> found </${token.tag}>`;
     }
 
killedBy: TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </B> found </B>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] ConditionalExpression
src/app/TagChecker.ts:22:11
 
       const top = this.stack.pop();
       if (!top) return `Expected # found </${token.tag}>`;
-      if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
+      if (true) return `Expected </${top}> found </${token.tag}>`;
     }
 
killedBy: TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </B> found </B>' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] ConditionalExpression
src/app/TagChecker.ts:25:9
       if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
     }
 
-    if (!this.stack.isEmpty()) {
+    if (true) {
       const top = this.stack.peek()!;
       return `Expected </${top}> found #`;
killedBy: SimpleTagScanner + TagChecker edge-cases empty tag '<>' is ignored; TagChecker correctly tagged simple paragraph
statusReason: expected 'Expected </undefined> found #' to be 'Correctly tagged paragraph' // Object.is equality

[Killed] BooleanLiteral
src/app/TagChecker.ts:25:9
       if (top !== token.tag) return `Expected </${top}> found </${token.tag}>`;
     }
 
-    if (!this.stack.isEmpty()) {
+    if (this.stack.isEmpty()) {
       const top = this.stack.peek()!;
       return `Expected </${top}> found #`;
killedBy: SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer; TagChecker correctly tagged simple paragraph
statusReason: expected 'Correctly tagged paragraph' to be 'Expected </B> found #' // Object.is equality

[Killed] StringLiteral
src/app/TagChecker.ts:27:14
 
     if (!this.stack.isEmpty()) {
       const top = this.stack.peek()!;
-      return `Expected </${top}> found #`;
+      return ``;
     }
 
killedBy: TagChecker missing closing tag at paragraph end; SimpleTagScanner + TagChecker edge-cases dangling '<' at end -> reports missing closer
statusReason: expected '' to be 'Expected </B> found #' // Object.is equality
